app/controllers/site_controller.rb

  def index

       session[:mainnav_status] = false

    @page = Page.find_by_title("Home")||"'Home' not found."
---
SELECT `pages`.* FROM `pages` WHERE (`pages`.`title` = 'home page') LIMIT 1